airFoil2D_mesh/system/snappyHexMeshDict_block
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



//**************************************************************************************************************************

// Which of the steps to run
castellatedMesh true;
snap            false;
addLayers       false;

//**************************************************************************************************************************



//**************************************************************************************************************************

geometry
{
 
    refinementBox
    {
        type searchableBox;
        min (-4 -4 -10);
        max ( 5  4  10);
    }

    refinementCylinder
    {
        type searchableCylinder;
        point1 ( 0.5 0 -10);
        point2 ( 0.5 0  10);
        radius 4;
    }
    refinementBox2
    {
        type searchableBox;
        min (5 -0.5 -10);
        max ( 12  1.5  10);
    }
    refinementBox3
    {
        type searchableBox;
        min (-0.5 -0.4 -10);
        max ( 2  0.4  10);
    }
};

//**************************************************************************************************************************



//**************************************************************************************************************************

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    maxLocalCells 100000;

    //maxGlobalCells 2000000;
    maxGlobalCells 10000000; //about 10GB memory

    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 3;

    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    features
    (

    );

    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    refinementSurfaces
    {

    }

    // Feature angle:

    //resolveFeatureAngle 10;
    resolveFeatureAngle 30;		//recommended

    //- Optional increment (on top of max level) in small gaps
    //gapLevelIncrement 2;

    planarAngle 30;

    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    refinementRegions
    {

        refinementBox
        {
            mode inside;   
            //levels ((1e15 1)); // 'levels ((distance level))'  only the level is used. All cells inside the surface get refined up to the level. Use same value in the tuple
            level 1; 
        }
        refinementBox2
        {
            mode inside;   
            //levels ((1e15 1)); // 'levels ((distance level))'  only the level is used. All cells inside the surface get refined up to the level. Use same value in the tuple
            level 1; 
        }
        refinementBox3
        {
            mode inside;   
            //levels ((1e15 1)); // 'levels ((distance level))'  only the level is used. All cells inside the surface get refined up to the level. Use same value in the tuple
            level 3; 
        }

        refinementCylinder
        {
            mode inside;   
            //levels ((1e15 2)); // 'levels ((distance level))'  only the level is used. All cells inside the surface get refined up to the level. Use same value in the tuple
            level 2; 
        }

    }

    // Mesh selection
    // ~~~~~~~~~~~~~~

//These two location can give problems because the point might be in a non hexa element
//You have to be careful to put the poin in a region with hexes
    //locationInMesh (4.0 0.0 0.0);  
    //locationInMesh (4.0 0.0 1);  

    locationInMesh (8.0 6.0 0.0); 

    allowFreeStandingZoneFaces true;

}

//**************************************************************************************************************************



//**************************************************************************************************************************

// Settings for the snapping.
snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;	//recommended
    //nSmoothPatch 10;	//improved

    tolerance 2.0;	//recommended
    //tolerance 1.0;

    nSolveIter 30;	//recommended
    //nSolveIter 100;	//improved

    nRelaxIter 5;	//recommended
    //nRelaxIter 10;	//improved	10-20-50

    // Feature snapping

        nFeatureSnapIter 10;		//recommended
        //nFeatureSnapIter 100;		//improved	50-100

//For 2D
        implicitFeatureSnap true;

        explicitFeatureSnap false;

        multiRegionFeatureSnap false;
}

//**************************************************************************************************************************



//**************************************************************************************************************************

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
    //relativeSizes false;

        expansionRatio 1.2;

        finalLayerThickness 0.5;	//relative sizes true

    minThickness 0.00001;

    layers
    {

    }

    nGrow 0;

        featureAngle 130;		//default
        maxFaceThicknessRatio 0.5;
        nSmoothSurfaceNormals 1;
        nSmoothThickness 10;
        minMedialAxisAngle 90;
        minMedianAxisAngle 90;
        maxThicknessToMedialRatio 0.3;
        nSmoothNormals 3;
        slipFeatureAngle 30;
        nRelaxIter 5;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;

}

//**************************************************************************************************************************



//**************************************************************************************************************************

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    // Specify mesh quality constraints in separate dictionary so can
    // be reused (e.g. checkMesh -meshQuality)
    #include "meshQualityDict"

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        // Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 75;
    }

    //minFlatness 0.5;

    // Advanced

        // Number of error distribution iterations
        nSmoothScale 4;
        // amount to scale back displacement at error points
        errorReduction 0.75;
}

//**************************************************************************************************************************



//**************************************************************************************************************************

// Advanced

//// Debug flags
/*
debugFlags
(
    mesh            // write intermediate meshes
    intersections   // write current mesh intersections as .obj files
    featureSeeds    // write information about explicit feature edge
                    // refinement
    attraction      // write attraction as .obj files
    layerInfo       // write information about layers
);
*/

//**************************************************************************************************************************



//**************************************************************************************************************************

//
//// Write flags

writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);

//**************************************************************************************************************************



// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
