airFoil2D_mesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.003 0 0);

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform (0.003 0 0);
    }
    
    maxX
    {
        type            zeroGradient;
    }
    
    minY  // BOTTOM - open boundary
    {
        type            freestream;
        freestreamValue uniform (0.003 0 0);
    }
    
    maxY  // TOP - open boundary
    {
        type            freestream;
        freestreamValue uniform (0.003 0 0);
    }
    
    minZ
    {
        type            empty;
    }
    
    maxZ
    {
        type            empty;
    }
    
    stlSurface
    {
        type            noSlip;
    }
}

// ************************************************************************* //