airFoil2D_mesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX  // INLET
    {
        type            zeroGradient;
    }
    
    maxX  // OUTLET
    {
        type            zeroGradient;
    }
    
    minY  // BOTTOM - open boundary
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    
    maxY  // TOP - open boundary
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    
    minZ
    {
        type            empty;
    }
    
    maxZ
    {
        type            empty;
    }
    
    stlSurface  // AIRFOIL
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //