airFoil2D_mesh/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minY
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxY
    {
        type            fixedValue;
        value           uniform 0;
    }
    minZ
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxZ
    {
        type            fixedValue;
        value           uniform 0;
    }
    stlSurface
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
16672
(
0.00350462
0.00075448
0.00350462
0.00350462
0.00350462
0.00350462
0.00350462
0.00350462
...
)
;
    }
}


// ************************************************************************* //
