airFoil2D_mesh/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type            calculated;
        value           uniform 0;
    }
    minY
    {
        type            calculated;
        value           uniform 0;
    }
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    stlSurface
    {
        type            calculated;
        value           nonuniform List<scalar> 
13936
(
0.531595
0.531711
0.531711
0.531668
0.531668
0.531527
0.531419
0.53136
...
)
;
    }
}


// ************************************************************************* //
